loadtest/jmeter/order-create-hot-sku.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Order Create Hot SKU" enabled="true">
      <stringProp name="TestPlan.comments">Create orders for hot SKU concurrency safety checks.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Order Users" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(THREADS,500)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(RAMP_UP,1)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Access Token SKU CSV" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">${__P(TOKEN_SKU_CSV,loadtest-output/order-create-token-sku.csv)}</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="quotedData">true</boolProp>
          <boolProp name="recycle">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">true</boolProp>
          <stringProp name="variableNames">userId,accessToken,skuId</stringProp>
        </CSVDataSet>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${accessToken}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Create Order" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
  "skuId": "${skuId}",
  "quantity": 1,
  "idempotencyKey": "order-loadtest-${__P(RUN_ID,local)}-${userId}-${__threadNum}"
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${__P(HOST,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(PORT,6655)}</stringProp>
          <stringProp name="HTTPSampler.protocol">${__P(PROTOCOL,https)}</stringProp>
          <stringProp name="HTTPSampler.path">/shopping/user/api/orders</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Capture Order Business Code" enabled="true">
            <stringProp name="cacheKey">order-business-code</stringProp>
            <stringProp name="script">def businessCode = ''
def orderNo = ''
def orderStatus = ''
try {
    def body = prev.getResponseDataAsString()
    if (body != null &amp;&amp; !body.isBlank()) {
        def json = new groovy.json.JsonSlurper().parseText(body)
        businessCode = (json.code ?: '').toString()
        if (json.data != null) {
            orderNo = (json.data.orderNo ?: '').toString()
            orderStatus = (json.data.status ?: '').toString()
        }
    }
} catch (Throwable ignored) {
}
vars.put('businessCode', businessCode)
vars.put('orderNo', orderNo)
vars.put('orderStatus', orderStatus)
def message = prev.getResponseMessage() ?: ''
if (businessCode) {
    message += ' businessCode=' + businessCode
}
if (orderNo) {
    message += ' orderNo=' + orderNo
}
if (orderStatus) {
    message += ' orderStatus=' + orderStatus
}
prev.setResponseMessage(message)
def expectedCodes = ['ORDER_CREATE_OK', 'ORDER_STOCK_NOT_ENOUGH', 'ORDER_ALREADY_CREATED'] as Set
prev.setSuccessful(expectedCodes.contains(businessCode))</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>